xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/hermes.c
/*****************************************************************************
*
* SUREFLAP CONFIDENTIALITY & COPYRIGHT NOTICE
*
* Copyright � 2013-2021 Sureflap Limited.
* All Rights Reserved.
*
* All information contained herein is, and remains the property of Sureflap 
* Limited.
* The intellectual and technical concepts contained herein are proprietary to
* Sureflap Limited. and may be covered by U.S. / EU and other Patents, patents 
* in process, and are protected by copyright law.
* Dissemination of this information or reproduction of this material is 
* strictly forbidden unless prior written permission is obtained from Sureflap 
* Limited.
*
* Filename: hermes.c   
* Author:   Chris Cowdery
* Purpose:   
*   
* Main start point for Hermes firmware (after low level startup)
*            
**************************************************************************/
// Project wide includes that can affect anything!
#include "hermes.h"
#include <stdarg.h>	// used by zprintf
#include <stdio.h>	// for vsprintf
/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "event_groups.h"
#include "timers.h"
#include "hermes-time.h"
/* FreeRTOS-TCP includes */
#include "FreeRTOS_IP.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
//#include "fsl_debug_console_conf.h"
#include "fsl_log.h"    // for LOG_Readline - entry into CLI
#include "fsl_pwm.h"
#include "board.h"
#include "fsl_wdog.h"
#include "fsl_pwm.h"
#include "fsl_xbara.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "fsl_flexspi_ram.h"
#include "fsl_iomuxc.h"
#include "fsl_cache.h"

// Other includes
#include "FreeRTOS_CLI.h"
#include "SureNet-interface.h"
#include "hermes-app.h"
#include "MQTT.h"
#include "SNTP.h"
#include "leds.h"
#include "Hermes-test.h"
#include "flashManager.h"
#include "resetHandler.h"
#include "HTTP_Helper.h"
#include "myMAC.h"		// just needed for initialisation
#include "Hermes-app.h"
#include "LabelPrinter.h"
#include "SureNet.h"	// for INITAL_CHANNEL
#include "HubFirmwareUpdate.h"
#include "BankManager.h"
#include "Signing.h"
#include "fault.h"
#include "Babel.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void shell_task(void *pvParameters);
void init_watchdog();

/* The CLI commands are defined in CLI-commands.c. */
void vRegisterBasicCLICommands(void);
void vRegisterCLICommands( void );

static const uint8_t ucIPAddress_printer[ 4 ] = { 192,168,0,2 };
static const uint8_t ucIPAddress[ 4 ] = { configIP_ADDR0, configIP_ADDR1, configIP_ADDR2, configIP_ADDR3 };
static const uint8_t ucNetMask[ 4 ] = { configNET_MASK0, configNET_MASK1, configNET_MASK2, configNET_MASK3 };
static const uint8_t ucGatewayAddress[ 4 ] = { configGATEWAY_ADDR0, configGATEWAY_ADDR1, configGATEWAY_ADDR2, configGATEWAY_ADDR3 };
static const uint8_t ucDNSServerAddress[ 4 ] = { configDNS_SERVER_ADDR0, configDNS_SERVER_ADDR1, configDNS_SERVER_ADDR2, configDNS_SERVER_ADDR3 };
static uint8_t initial_RF_channel;
BaseType_t xTCstatus;
static WDOG_Type *wdog_base = WDOG1;

TaskHandle_t xHermesTestTaskHandle;
TaskHandle_t xFM_hermesFlashTaskHandle;
TaskHandle_t xStartupTaskHandle;
TaskHandle_t xHTTPPostTaskHandle;
TaskHandle_t xHFUTaskHandle;

extern QueueHandle_t xNvStoreMailboxSend;
extern QueueHandle_t xNvStoreMailboxResp;

//Global variable with some useful product information within. Initialised from Flash on boot.
bool shouldIPackageFlag = false;
bool shouldICryptFlag = false;
bool amILocked = true;
bool global_message_trace_flag = false;	// turned on by messagedump CLI command
PRODUCT_CONFIGURATION product_configuration;	// This is a RAM copy of the product info from Flash.
// local functions
void write_product_configuration(void);
static void StartUpTask(void *pvParameters);
static void watchdog_task(void *pvParameters);
static void service_watchdog(void);
uint8_t printLevel = LOW_IMPORTANCE;
void Core_detect(void);
bool immediate_firmware_update = false;
uint64_t	rfmac;	// global because a pointer to this variable is used by the RF Stack
bool rf_channel_override = false;

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief Application entry point.
 */

// This is a bit of debug code that can be uncommented out (along with it's
// enabling code in BOARD_ConfigInterrupts())
//void BUTTON_IRQ_HANDLER(void)   // overrides weakly linked handler in startup_MIMXRT1021.s
//{
//	LED_SET_3(LEDS_ON);
//	while(1);
//}
int Init(void)
{ 
	flexspi_nor_flash_init(FLEXSPI);    // Enables all 4Mb flash

	BOARD_ConfigMPU();  // Set permissions on memories
    BOARD_InitPins();
    BOARD_ConfigGPIOPins();
    BOARD_BootClockRUN();
	enable_spread_spectrum();
	turn_off_unneccessary_clocks();

    BOARD_InitDebugConsole();
    BOARD_ConfigTimers();
    BOARD_ConfigInterrupts();
    BOARD_ConfigSPI();      // should be checked for kStatus_Success
    BOARD_ConfigPwm();
    BOARD_ConfigTRNG();	// random number generator

#if USE_LEDS_FOR_DEBUG
	// temporary for debug - connects GPIO2 to LEDs
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_GPIO2_IO23,0U); // PWMLED4 - Green
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_GPIO2_IO24,0U); // PWMLED3 - Red
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_GPIO2_IO25,0U); // PWMLED2 - Green
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_GPIO2_IO26,0U); // PWMLED1 - Red
	LED_SET_3(LEDS_OFF);
#endif

#ifdef DEBUG
#warning DEBUG build is deprecated. DO NOT USE
#endif
	
    /* enable watchdog - set for 16 secs. Only active in Release configuration*/
    init_watchdog();

	BM_ResolveBankUse();	// work out whether we are in Bank A or Bank B

	if( 0==GPIO_PinRead(BUTTON_GPIO, BUTTON_GPIO_PIN))
	{
		uint32_t buttondown = get_microseconds_tick();
		while(0==GPIO_PinRead(BUTTON_GPIO, BUTTON_GPIO_PIN));
		if( (get_microseconds_tick()-buttondown)<5*usTICK_SECONDS)
			immediate_firmware_update = true;	// tact pressed at power up, so let's just do f/w update
		else
			rf_channel_override=true;	// meant for blocking_test
	}

    // Set up LED driver
    led_driver_init();

