xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/hermes.c
	/* Register the command line commands with the CLI */
	vRegisterBasicCLICommands();

	// Initialise the Flash Manager
	if( kStatus_Fail == FM_hermesFlashInit())
	{
		while(1);	// panic??
	}

    if (xTaskCreate(StartUpTask, "Startup", STARTUP_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xStartupTaskHandle) != pdPASS)
    {
        while(1);
	}

	vTaskStartScheduler();
	for (;;)
        ;
}

/**************************************************************
 * Function Name   : StartUpTask
 * Description     : This handles the retrieval of config data from flash
 *                 : and then the startup of all the other tasks.
 *                 : When complete, it kills itself.
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
static void StartUpTask(void *pvParameters)
{
	SEND_TO_FM_MSG	nvNvmMessage;    // Outgoing message	to Flash Manager
    uint32_t		notifyValue;
    PERSISTENT_DATA *pNvPersistent = (PERSISTENT_DATA*)FM_PERSISTENT_PAGE_ADDR; // Persistent data page
	BANK_DESCRIPTOR	new_descriptor;
	extern const volatile BANK_DESCRIPTOR*	CurrentDescriptor;
	BANK_DESCRIPTOR *OtherBankDescriptor;
	uint32_t		i;

	// the first thing we need is the flash handler so we can get info from the Flash
    if( xTaskCreate(FM_hermesFlashTask, "Hermes_Flash_Manager", FLASH_MANAGER_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xFM_hermesFlashTaskHandle) != pdPASS )
    {
        zprintf(CRITICAL_IMPORTANCE, "Hermes Flash Manager task creation failed!.\r\n");
	}

	// First activity is to check if we were reset via a watchdog trigger, if so, update
	// the bank descriptor.
	// Note this might benefit from being done earlier, i.e. before this task starts, but that
	// would mean using a new interface to the flash memory as the Flash Manager is task-based.

	if( (0 != (SRC_SRSR_WDOG_RST_B_MASK & SRC->SRSR)) )
	{	// watchdog has fired.

		// Copy bank descriptor into RAM so we can update it before writing it back.
		memcpy(&new_descriptor, (uint8_t *)CurrentDescriptor, sizeof(BANK_DESCRIPTOR));

		new_descriptor.watchdog_resets++;
		if( new_descriptor.watchdog_resets >= MAX_WATCHDOG_RESETS)
		{ // we should roll back here, but only if the other bank has a valid and older revision available
			OtherBankDescriptor = CurrentDescriptor->opposite;
			if( (OtherBankDescriptor->bank_mark > BANK_MARK_UNINITIALISED) &&	// valid version
			    (OtherBankDescriptor->bank_mark < CurrentDescriptor->bank_mark) ) // older than this version
			{
				zprintf(CRITICAL_IMPORTANCE,"Max watchdog resets exceeded - rolling back (i.e. use other bank)\r\n");
				new_descriptor.bank_mark = BANK_MARK_ROLLED_BACK;	// we don't want to use this bank any more
			}
			// else cannot roll back
			else
				zprintf(LOW_IMPORTANCE,"Cannot roll back\r\n");
		}

		// Update the hash!
		new_descriptor.descriptor_hash = 0;
		for( i=4; i<sizeof(BANK_DESCRIPTOR)/sizeof(uint32_t); i++ )
		{
			new_descriptor.descriptor_hash ^= *(((uint32_t*)&new_descriptor)+i);
		}

		// write the descriptor back to flash
		hermesFlashRequestErase((uint8_t*)CurrentDescriptor, sizeof(BANK_DESCRIPTOR), true);
		hermesFlashRequestWrite((uint8_t*)&new_descriptor, (uint8_t*)CurrentDescriptor, sizeof(BANK_DESCRIPTOR), true);
		DCACHE_InvalidateByRange((uint32_t)CurrentDescriptor, sizeof(BANK_DESCRIPTOR));
		DbgConsole_Flush();

		// if we have set the bank mark to ROLLED_BACK, we will reset the core and flip to the other bank
		if( BANK_MARK_ROLLED_BACK == new_descriptor.bank_mark)
		{
			SRC->SRSR = SRC_SRSR_WDOG_RST_B_MASK;	// clear status bit in reset cause register.
			NVIC_SystemReset();
		}
	}

	// Now read product_configuration from flash
	nvNvmMessage.ptrToBuf	= (uint8_t *)&product_configuration;
	nvNvmMessage.type		= FM_PRODUCT_CONFIG;
	nvNvmMessage.dataLength	= sizeof(PRODUCT_CONFIGURATION);
	nvNvmMessage.action		= FM_GET;
	nvNvmMessage.xClientTaskHandle = xTaskGetCurrentTaskHandle();

    xQueueSend(xNvStoreMailboxSend, &nvNvmMessage, 0);	// get device table into RAM

    if( xTaskNotifyWait(0, 0, &notifyValue, portMAX_DELAY) == pdTRUE )
    {
		if( notifyValue == FM_ACK )
		{	// Got the values into product_configuration
        	printLevel = MEDIUM_IMPORTANCE;                                     // Limit the CLI messages when communicating with Programmer
			if( (product_configuration.sanity_state==PRODUCT_NOT_CONFIGURED) )//||
//				(myRFMAC != product_configuration.rf_mac) ||
//				(0 != strcmp(mySecretSerial, (char const *)product_configuration.secret_serial)) ||
//				(0 != strcmp(mySerial, (char const *)product_configuration.serial_number)) )	// **** THESE THREE LINES TEMPORARY FOR DEVELOPMENT TO KEEP PRODUCT_CONFIGURATION SYNCHRONISED WITH MYMAC.H
			{	// we need to put some sensible defaults in place
				// we will only overwrite the MAC addresses and serials if they are 0xff's. Otherwise we will
				// leave them as they were.
				if( (product_configuration.ethernet_mac[0] == 0xff) &&
					(product_configuration.rf_mac == 0xffffffffffffffff) &&
					(product_configuration.rf_pan_id == 0xffff))
				{	// we are pretty sure that the flash area is actually blank so we can put some sensible values in it
					uint8_t ethmac[6] = myEthMAC;
					memcpy(product_configuration.ethernet_mac, ethmac, 6);	// retrieve ethernet mac
					strcpy((char*)product_configuration.serial_number, mySerial);	// serial number
					strcpy((char*)product_configuration.secret_serial, mySecretSerial);
					product_configuration.rf_mac = myRFMAC;
					product_configuration.rf_pan_id = SUREFLAP_PAN_ID;
				}
				// but we put sensible values in this lot regardless
				product_configuration.sanity_state = PRODUCT_CONFIGURED;
				product_configuration.product_state = PRODUCT_BLANK;	// leave product_state ready for programming / test / label steps
				product_configuration.rf_mac_mangle = true;
				product_configuration.spare1 = 0;
				product_configuration.spare2 = 0;
				product_configuration.spare3 = 0;
				for( i=0; i<DERIVED_KEY_LENGTH; i++) { product_configuration.DerivedKey[i] = 0xff; }
				write_product_configuration();
				FM_store_persistent_data(PERSISTENT_BRIGHTNESS, (uint32_t)LED_MODE_NORMAL);
				FM_store_persistent_data(PERSISTENT_PRINTLEVEL, (uint32_t)printLevel);
				FM_store_persistent_data(PERSISTENT_RF_CHANNEL, (uint32_t)INITIAL_CHANNEL);
			}
		}
	}

	if( true == product_configuration.rf_mac_mangle)
	{ // we mangle it by putting 0xfffe in the middle, and use the 6 byte Ethernet one around it
	// This is because Pet Doors reject Hub MAC addresses that do not have 0xfffe in the middle
		((uint8_t *)&rfmac)[7] = product_configuration.ethernet_mac[0];
		((uint8_t *)&rfmac)[6] = product_configuration.ethernet_mac[1];
		((uint8_t *)&rfmac)[5] = product_configuration.ethernet_mac[2];
		((uint8_t *)&rfmac)[4] = 0xFF;
		((uint8_t *)&rfmac)[3] = 0xFE;
		((uint8_t *)&rfmac)[2] = product_configuration.ethernet_mac[3];
		((uint8_t *)&rfmac)[1] = product_configuration.ethernet_mac[4];
		((uint8_t *)&rfmac)[0] = product_configuration.ethernet_mac[5];
	}	// the apparent swapping of endianness is because the RF mac is stored as a uint64_t
		// but the Ethernet mac is stored as a byte array.
	else
	{
		rfmac = product_configuration.rf_mac;
	}

	// This must come before TCP initialisation as it sets up some mailboxes used by TCP/IP
    hermes_app_init();

	if( false == rf_channel_override)	// swap RF channels if button held down for >5 secs
	{
	initial_RF_channel = pNvPersistent->RF_channel;
	}
	else
	{
		if( RF_CHANNEL1 == pNvPersistent->RF_channel)
			initial_RF_channel = RF_CHANNEL3;
		else
			initial_RF_channel = RF_CHANNEL1;
	}

	switch (product_configuration.product_state)
	{
		case PRODUCT_NOT_CONFIGURED:	// should never get here!!
			shouldICryptFlag = false;
			shouldIPackageFlag = false;
        	printLevel = LOW_IMPORTANCE;
        	zprintf(MEDIUM_IMPORTANCE,"\r\n\r\nSure Petcare Hub - 'Hermes'\r\n---------------------------\r\n");
			zprintf(MEDIUM_IMPORTANCE,"PRODUCT NOT CONFIGURED\r\n");
			if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
			}
			if( xTaskCreate(watchdog_task, "watchdog_task", WATCHDOG_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Watchdog task creation failed! - tick... tick... tick...\r\n");
			}
			break;
		case PRODUCT_BLANK: // This is the state after a reset after firmware programming. It needs to support 'test'
			shouldICryptFlag = false;
			shouldIPackageFlag = false;
        	printLevel = MEDIUM_IMPORTANCE;                                     // Limit the CLI messages when communicating with Programmer
			if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
			}
			FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, product_configuration.ethernet_mac, pdFALSE, NORMAL_TASK_PRIORITY );
            /* The call to surenet_init() is now controlled by the Programmer, via CLI */
			if( xTaskCreate(led_task, "led_task", LED_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
    		{
				zprintf(CRITICAL_IMPORTANCE,"LED task creation failed!\r\n");
    		}
			if (xTaskCreate(hermesTestTask, "Hermes_Test", TEST_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHermesTestTaskHandle) != pdPASS)
    		{
				zprintf(CRITICAL_IMPORTANCE,"Hermes Test task creation failed!.\r\n");
			}
			if( xTaskCreate(watchdog_task, "watchdog_task", WATCHDOG_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Watchdog task creation failed! - tick... tick... tick...\r\n");
			}
			break;
		case PRODUCT_TESTED:	// Now I want to talk to the Label Printer
		  	shouldICryptFlag = false;
			shouldIPackageFlag = false;
        	printLevel = LOW_IMPORTANCE;
        	zprintf(MEDIUM_IMPORTANCE,"\r\n\r\nSure Petcare Hub - 'Hermes'\r\n---------------------------\r\n");
			zprintf(MEDIUM_IMPORTANCE,"PRODUCT_TESTED - expecting Label Printer\r\n");
			if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
			}
			FreeRTOS_IPInit( ucIPAddress_printer, ucNetMask, ucIPAddress_printer, ucIPAddress_printer, product_configuration.ethernet_mac, pdFALSE, HIGH_TASK_PRIORITY );
			if( xTaskCreate(led_task, "led_task", LED_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"LED task creation failed!\r\n");
			}
			if( xTaskCreate(label_task, "Label Printer task", LABEL_PRINTER_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Label printer creation failed!\r\n");
			}
			if( xTaskCreate(watchdog_task, "watchdog_task", WATCHDOG_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Watchdog task creation failed! - tick... tick... tick...\r\n");
			}
			break;
		case PRODUCT_CONFIGURED:	// everything set up, now I am ready for a customer
			GenerateSharedSecret(SHARED_SECRET_CURRENT);	// generate a truly random Shared Secret to be shared with the Server
			GenerateDerivedKey(DERIVED_KEY_CURRENT);	// Used for signing data transfers between Hub and Server.
					
