xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/hermes.c
			//Delay boot-up by 2 seconds.  The LEDs will be off for this period, giving us a visual indication if the device ever reboots.
			vTaskDelay(pdMS_TO_TICKS(2000));

			BABEL_set_aes_key(product_configuration.serial_number);
			BABEL_aes_encrypt_init();

		  	shouldIPackageFlag = SHOULD_I_PACKAGE;
			shouldICryptFlag = false;//true for AES Encryption

#ifdef DEBUG
        	printLevel = LOW_IMPORTANCE;
#else
			printLevel = CRITICAL_IMPORTANCE;
#endif
        	zprintf(CRITICAL_IMPORTANCE,"\r\n\r\nSure Petcare Hub - 'Hermes'\r\n---------------------------\r\n");
#ifdef DEBUG
			zprintf(CRITICAL_IMPORTANCE,"DEBUG build - NOT FOR RELEASE!\r\n");
#endif
			// Initialise Hub Firmware Update - this requires the Secret Serial to have been read
			// from flash into product_configuration.secret_serial for key calculation
			HFU_init();
			if( xTaskCreate(watchdog_task, "watchdog_task", WATCHDOG_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Watchdog task creation failed! - tick... tick... tick...\r\n");
			}
			if( false == immediate_firmware_update )
			{	// normal operation
				DisplayResetStatus();
				Core_detect();
				set_led_brightness(get_led_brightness(),false);     // from nvm
				update_led_view();
				// CONSIDER NOT STARTING THIS TASK FOR RELEASE BUILD...
				if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
				}
				FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, product_configuration.ethernet_mac, pdTRUE, HIGH_TASK_PRIORITY );

				// Start SureNet

				surenet_init(&rfmac, product_configuration.rf_pan_id,initial_RF_channel); // This initialises stack variables and starts the surenet task.

				HTTPPostTask_init();

				SNTP_Init();
				if( xTaskCreate(SNTP_Task, "SNTP Task", SNTP_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE, "SNTP Task creation failed!\r\n");
				}

				if( xTaskCreate(led_task, "led_task", LED_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE,"LED task creation failed!\r\n");
				}

				if( xTaskCreate(hermes_app_task, "Hermes Application", HERMES_APPLICATION_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE, "Hermes Application task creation failed!\r\n");
				}

				if( xTaskCreate(MQTT_Task, "MQTT", MQTT_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE,"MQTT Task creation failed!\r\n");
				}

				if (xTaskCreate(hermesTestTask, "Hermes_Test", TEST_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHermesTestTaskHandle) != pdPASS)
				{
					zprintf(CRITICAL_IMPORTANCE,"Hermes Test task creation failed!.\r\n");
				}

				if (xTaskCreate(HTTPPostTask, "HTTP Post", HTTP_POST_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHTTPPostTaskHandle) != pdPASS)
				{
					zprintf(CRITICAL_IMPORTANCE,"HTTP Post task creation failed!.\r\n");
				}
				if (xTaskCreate(HFU_task, "Hub Firmware Update", HFU_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHFUTaskHandle) != pdPASS)
				{
					zprintf(CRITICAL_IMPORTANCE,"Hub Firmware Update task creation failed!.\r\n");
				}
			} else	// 	immediate_firmware_update == true
			{		// So we don't need to do a lot here
				LED_Request_Pattern(LED_MODE_NORMAL, COLOUR_RED, LED_PATTERN_SOLID, 0);

				// CONSIDER NOT STARTING THIS TASK FOR RELEASE BUILD...
				if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
				}
				FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, product_configuration.ethernet_mac, pdTRUE, HIGH_TASK_PRIORITY );

				HTTPPostTask_init();

				SNTP_Init();	// This is required as Signing requires UTC to be correct
				if( xTaskCreate(SNTP_Task, "SNTP Task", SNTP_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE, "SNTP Task creation failed!\r\n");
				}
				
				if( xTaskCreate(led_task, "led_task", LED_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
				{
					zprintf(CRITICAL_IMPORTANCE,"LED task creation failed!\r\n");
				}
				if (xTaskCreate(HTTPPostTask, "HTTP Post", HTTP_POST_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHTTPPostTaskHandle) != pdPASS)
				{
					zprintf(CRITICAL_IMPORTANCE,"HTTP Post task creation failed!.\r\n");
				}
				if (xTaskCreate(HFU_task, "Hub Firmware Update", HFU_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHFUTaskHandle) != pdPASS)
				{
					zprintf(CRITICAL_IMPORTANCE,"Hub Firmware Update task creation failed!.\r\n");
				}

				// Now we need to wait for DHCP, then trigger a SNTP fetch, and finally
				// kick off a Hub Firmware Update
				extern EventGroupHandle_t	xConnectionStatus_EventGroup;
				xEventGroupWaitBits(xConnectionStatus_EventGroup, CONN_STATUS_NETWORK_UP, false, false, portMAX_DELAY );
				while(false == SNTP_AwaitUpdate(true, portMAX_DELAY));			
				HFU_trigger(true);
			}
			break;
		default:	// Not sure what to do here - something's gone wrong with Flash
        	printLevel = LOW_IMPORTANCE;
        	zprintf(MEDIUM_IMPORTANCE,"\r\n\r\nSure Petcare Hub - 'Hermes'\r\n---------------------------\r\n");
			zprintf(MEDIUM_IMPORTANCE,"CONFIGURATION CORRUPTED\r\n");
			if( xTaskCreate(shell_task, "Shell_task", SHELL_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Shell task creation failed!\r\n");
			}
			if( xTaskCreate(watchdog_task, "watchdog_task", WATCHDOG_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
			{
				zprintf(CRITICAL_IMPORTANCE,"Watchdog task creation failed! - tick... tick... tick...\r\n");
			}
			break;
	}

	vTaskDelete(NULL);	// my work is done, now I fly to Switzerland.
}

/**************************************************************
 * Function Name   : set_product_state
 * Description     : Sets product state and writes to flash. To be called
 *                 : by production tester and label printer
 * Inputs          : one of PRODUCT_BLANK, PRODUCT_TESTED or PRODUCT_CONFIGURED
 * Outputs         :
 * Returns         :
 **************************************************************/
void set_product_state(PRODUCT_STATE state)
{
	product_configuration.product_state = state;
	write_product_configuration();
}

/**************************************************************
 * Function Name   : Sanitise Product Configuration
 * Description     : Writes PRODUCT_NOT_CONFIGURED to sanity_state, which
 *                 : will cause the NVM to be refreshed with sane values
 *                 : on the next processor reset. Useful if the format of
 *                 : NVM has changed and it needs initialising
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void sanitise_product_config(void)
{
	SEND_TO_FM_MSG	nvNvmMessage;    // Outgoing message	to Flash Manager
    uint32_t		notifyValue;

	nvNvmMessage.ptrToBuf	= (uint8_t *)&product_configuration;
	nvNvmMessage.type		= FM_PRODUCT_CONFIG;
	nvNvmMessage.dataLength	= sizeof(PRODUCT_CONFIGURATION);
	nvNvmMessage.action		= FM_GET;
	nvNvmMessage.xClientTaskHandle = xTaskGetCurrentTaskHandle();

    xQueueSend(xNvStoreMailboxSend, &nvNvmMessage, 0);	// get device table into RAM

