xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/hermes.c
    if( xTaskNotifyWait(0, 0, &notifyValue, portMAX_DELAY) == pdTRUE )
    {
		if( notifyValue == FM_ACK )
		{	// Got the values into product_configuration
			product_configuration.sanity_state = PRODUCT_NOT_CONFIGURED;
			product_configuration.product_state = PRODUCT_NOT_CONFIGURED;
			write_product_configuration();	// write 0xff into configuration
		}
	}
}

/**************************************************************
 * Function Name   : write_product_configuration
 * Description     : Store product_configuration in NV Store
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void write_product_configuration(void)
{
	SEND_TO_FM_MSG nvNvmMessage;    // Outgoing message
    uint32_t notifyValue;
	uint8_t i;
	uint8_t *rfmac = (uint8_t *)&product_configuration.rf_mac;

	zprintf(LOW_IMPORTANCE,"Writing product configuration:\r\n");
	zprintf(LOW_IMPORTANCE,"RF MAC : ");
	for( i=0; i<8; i++ )
		zprintf(LOW_IMPORTANCE,"%02X ",rfmac[i]);
	zprintf(LOW_IMPORTANCE,"\r\nPANID :%04X\r\n",product_configuration.rf_pan_id);
	zprintf(LOW_IMPORTANCE,"Serial number : %s\r\n",product_configuration.serial_number);
	zprintf(LOW_IMPORTANCE,"Ethernet MAC : ");
	for( i=0; i<6; i++ )
		zprintf(LOW_IMPORTANCE,"%02X ",product_configuration.ethernet_mac[i]);
	zprintf(LOW_IMPORTANCE,"\r\n");

	nvNvmMessage.ptrToBuf = (uint8_t *)&product_configuration;
	nvNvmMessage.dataLength = sizeof(PRODUCT_CONFIGURATION);
	nvNvmMessage.type = FM_PRODUCT_CONFIG;
	nvNvmMessage.action = FM_PUT;
	nvNvmMessage.xClientTaskHandle = xTaskGetCurrentTaskHandle();

	xQueueSend(xNvStoreMailboxSend, &nvNvmMessage, 0);	// Write product configuration

	if( xTaskNotifyWait(0, 0, &notifyValue, portMAX_DELAY ) == pdTRUE )
	{
		if( notifyValue == FM_ACK )
		{
			zprintf(MEDIUM_IMPORTANCE,"Product configuration written\r\n");
		} else
		{
			zprintf(HIGH_IMPORTANCE,"Product configuration write failed\r\n");
		}
	} else
	{
		zprintf(HIGH_IMPORTANCE,"Notification of Product configuration Write did not arrive\r\n");
	}
	DbgConsole_Flush();
}

// quick and dirty task written by Chris to give a shell-like Debug interface.
// uses FreeRTOS CLI
// It gets timesliced by other tasks of the same priority, and pre-empted by higher priority tasks.
char output[256];
static void shell_task(void *pvParameters)
{
    BaseType_t result;
    char input[256];
    vTaskDelay(pdMS_TO_TICKS( 1000 ));  // just wait for other initialisation messages to be emitted
    zprintf(MEDIUM_IMPORTANCE,"\r\nEnter 'help' for help\r\n");
    while(1)
    {
        zprintf(CRITICAL_IMPORTANCE, "HERMES >");
        LOG_ReadLine((uint8_t *)input, sizeof(input));
        zprintf(CRITICAL_IMPORTANCE, "\r\n");
        do
        {
		    result = FreeRTOS_CLIProcessCommand( input, output, sizeof(output) );  // process input and generate some output
			if( strlen(output)>256)
			{
				zprintf(CRITICAL_IMPORTANCE,"CLI Output too long! - system may become unstable");
				output[sizeof(output)-1]='\0';	// we still want to know what the output was for debugging purposes
			}
            zprintf(CRITICAL_IMPORTANCE, output); // print the partial output
			DbgConsole_Flush();
        } while( result == pdTRUE ); // keep looping around until all output has been generated
        vTaskDelay(pdMS_TO_TICKS( 100 ));   // give up CPU for 100ms
    }
}

/**************************************************************
 * Function Name   : watchdog_task
 * Description     : Kicks the 'dog every 5 seconds
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
static void watchdog_task(void *pvParameters)
{ 	
	uint32_t				mqtt_reboot_timestamp;
	MQTT_CONNECTION_STATE	mqtt_connection_state;
	
	mqtt_reboot_timestamp = get_microseconds_tick();	
	
    while(1)
    {
		service_watchdog();
		mqtt_connection_state = get_mqtt_connection_state();
		// This is brutal. If we fall outside MQTT_STATE_CONNECTED for too
		// long, we just reboot the Hub !!
		if( (MQTT_STATE_CONNECTED == mqtt_connection_state) || 
		    (MQTT_STATE_STOP == mqtt_connection_state))
		{
			mqtt_reboot_timestamp = get_microseconds_tick();
		}
		else
		{
			if( (get_microseconds_tick()-mqtt_reboot_timestamp) > MQTT_REBOOT_TIMEOUT)
			{
				zprintf(CRITICAL_IMPORTANCE,"MQTT detected lack of traffic - restarting system...\r\n");
				DbgConsole_Flush();
				NVIC_SystemReset(); // never returns
			}
		}
				
        vTaskDelay(pdMS_TO_TICKS( 5000 ));   // give up CPU for 5 seconds
    }
}


/* Initialise watchdog - only do once, at startup */
void init_watchdog(void)
{
	wdog_base = WDOG1;
#ifdef DEBUG
	WDOG_Deinit(wdog_base);
#else
	wdog_config_t config;
    WDOG_GetDefaultConfig(&config);
	config.workMode.enableDebug = true;
    config.timeoutValue = WDOG_TIMEOUT_VALUE;
    config.interruptTimeValue = WDOG_INT_TIME_VALUE;
    config.enableInterrupt = true;
    WDOG_Init(wdog_base, &config);
#endif
}

static void service_watchdog(void)
{
#ifndef DEBUG
    WDOG_Refresh(wdog_base);
#endif
}

#ifndef DEBUG
/* For completeness... probably not required */
/* Provides early warning of reset */
void WDOG1_IRQHandler(void)
{
     /* Clear WTIS interrupt flag.*/
    WDOG1->WICR |= 1<<14;
	uart_puts("Watchdog about to fire...\r\n");
}
#endif

//#define TIMESTAMP_ZPRINTF_OUTPUT	// Note this breaks Alohomora, so should only be used with a terminal
#define ZBUFFER_SIZE	384
void zprintf(ZPRINTF_IMPORTANCE importanceLevel, const char *arg0, ...)
{
	static uint32_t zprintfCorrelationIDCounter = 0;
	uint32_t 			len;
    va_list 			args;	
	char 				*zbuffer;
	HERMES_UART_HEADER	*header;	

	if( 0 == strlen(arg0) )
	{
		return;
	}

    if( (importanceLevel <= MAX_PRINT_LEVEL) && (importanceLevel >= printLevel) )
	{
		if(shouldIPackageFlag == true)
		{
    		va_start(args, arg0);
			len = vsnprintf(NULL,0,arg0,args) + 1;	// find out how long the string would be, excluding terminating \0
			va_end(args);	
#ifdef TIMESTAMP_ZPRINTF_OUTPUT
			len += 9;	// allow for extra HH:MM:SS that would be prepended.
#endif
			if( len > ZBUFFER_SIZE) {return;}	// string too long

			header = pvPortMalloc(len+sizeof(HERMES_UART_HEADER));
	
