xSouln/Examples_STM32F407VET6_JZ/SureFlap/source/hermes.c
			if( NULL == header) {return;}	// drop output if cannot allocate buffer

			zbuffer = (char *)header + sizeof(HERMES_UART_HEADER);
			
			len = 0;
#ifdef TIMESTAMP_ZPRINTF_OUTPUT
			len += time_string(zbuffer);
			zbuffer += len;
#endif			
			
			va_start(args, arg0);
			len += vsprintf(zbuffer, arg0, args);
			va_end(args);	
			
			header->sync_word = 0x6863615A;
			if(importanceLevel == NOT_ENCRYPT_IMPORTANCE)
			{
				header->type = MESSAGE_GREETING;
			}
			else
			{
				header->type = MESSAGE_RESPONSE;
			}

			header->check = header->type ^ 0xFF;

			if(shouldICryptFlag == true)	// this is probably broken
			{
				uint32_t TotalWidth = (((strlen(zbuffer) + 15)/16)*16);

				if(TotalWidth == 0)
				{
					header->correlation_ID++;
				}
				else
				{
					sprintf(zbuffer,"%-*s",TotalWidth,zbuffer);
				}
			}

			header->size = len;
			header->timestamp = get_microseconds_tick();
			header->correlation_ID = zprintfCorrelationIDCounter++;
			LOG_Push((uint8_t*)header,sizeof(HERMES_UART_HEADER)+len);	// single push of whole message
			vPortFree(header);	
		}
		else
		{	// Not packaging, so straight printout
			va_start(args, arg0);
			len = vsnprintf(NULL,0,arg0,args) + 1;	// find out how long the string would be, excluding terminating \0
			va_end(args);	
#ifdef TIMESTAMP_ZPRINTF_OUTPUT
			len += 9;	// allow for extra HH:MM:SS that would be prepended.
#endif
			if( len > ZBUFFER_SIZE) {return;}
			zbuffer = pvPortMalloc(len);
			if( NULL == zbuffer) {return;}		
			len = 0;
#ifdef TIMESTAMP_ZPRINTF_OUTPUT
			len += time_string(zbuffer);
#endif
			va_start(args, arg0);
			len += vsprintf(zbuffer+len, arg0, args);
			va_end(args);				
			LOG_Push((uint8_t*)zbuffer,len);
			vPortFree(zbuffer);
		}
	}
}
/**************************************************************
 * Function Name   : Core_detect
 * Description     : Check revision of CPU core
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void Core_detect(void)
{
  uint32_t cpuid = SCB->CPUID;
  uint32_t var, pat;

//  printf("CPUID %08X DEVID %03X REVID %04X\n", cpuid, DBGMCU->IDCODE & 0xFFF, (DBGMCU->IDCODE >> 16) & 0xFFFF);

  zprintf(LOW_IMPORTANCE,"Detected Core: ");

  pat = (cpuid & 0x0000000F);
  var = (cpuid & 0x00F00000) >> 20;

  if ((cpuid & 0xFF000000) == 0x41000000) // ARM
  {
    switch((cpuid & 0x0000FFF0) >> 4)
    {
      case 0xC20 : zprintf(LOW_IMPORTANCE,"Cortex M0 r%dp%d\r\n", var, pat); break;
      case 0xC60 : zprintf(LOW_IMPORTANCE,"Cortex M0+ r%dp%d\r\n", var, pat); break;
      case 0xC21 : zprintf(LOW_IMPORTANCE,"Cortex M1 r%dp%d\r\n", var, pat); break;
      case 0xC23 : zprintf(LOW_IMPORTANCE,"Cortex M3 r%dp%d\r\n", var, pat); break;
      case 0xC24 : zprintf(LOW_IMPORTANCE,"Cortex M4 r%dp%d\r\n", var, pat); break;
      case 0xC27 : zprintf(LOW_IMPORTANCE,"Cortex M7 r%dp%d\r\n", var, pat); break;

      default : zprintf(LOW_IMPORTANCE,"Unknown CORE\r\n");
    }
  }
  else
    zprintf(LOW_IMPORTANCE,"Unknown CORE IMPLEMENTER\r\n");
}

/**************************************************************
 * Function Name   : Diagnostic function that just turns on an LED combination and hangs up
 * Description     :
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void led_hang(uint8_t val)
{
	// Switch LED pins from PWM to GPIO so we can directly manipulate them
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_GPIO2_IO23,0U); // PWMLED4 - Green
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_GPIO2_IO24,0U); // PWMLED3 - Red
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_GPIO2_IO25,0U); // PWMLED2 - Green
	IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_GPIO2_IO26,0U); // PWMLED1 - Red

  	GPIO2->DR &= 0xf87fffff;
	GPIO2->DR |= (val<<23);

	while(1);
}

/**************************************************************
 * Function Name   : initSureNetByProgrammer
 * Description     : Used by the Programmer to control SureNet initialisation.
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void initSureNetByProgrammer(void)
{
    surenet_init(&product_configuration.rf_mac, product_configuration.rf_pan_id, initial_RF_channel); // This initialises stack variables and starts the surenet task.
}

/**************************************************************
 * Function Name   : connectToServer
 * Description     : Used by the test framework to register a
 *                 : blank mode Hub2 with SurePetCare server.
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void connectToServer(void)
{
    HFU_init();
    HTTPPostTask_init();
    SNTP_Init();
    if( xTaskCreate(SNTP_Task, "SNTP Task", SNTP_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
    {
        zprintf(CRITICAL_IMPORTANCE, "SNTP Task creation failed!\r\n");
    }

    if( xTaskCreate(hermes_app_task, "Hermes Application", HERMES_APPLICATION_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
    {
        zprintf(CRITICAL_IMPORTANCE, "Hermes Application task creation failed!\r\n");
    }

    if( xTaskCreate(MQTT_Task, "MQTT", MQTT_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, NULL) != pdPASS )
    {
        zprintf(CRITICAL_IMPORTANCE,"MQTT Task creation failed!\r\n");
    }

    if (xTaskCreate(HTTPPostTask, "HTTP Post", HTTP_POST_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHTTPPostTaskHandle) != pdPASS)
    {
        zprintf(CRITICAL_IMPORTANCE,"HTTP Post task creation failed!.\r\n");

    }

    if (xTaskCreate(HFU_task, "Hub Firmware Update", HFU_TASK_STACK_SIZE, NULL, NORMAL_TASK_PRIORITY, &xHFUTaskHandle) != pdPASS)
    {
        zprintf(CRITICAL_IMPORTANCE,"Hub Firmware Update task creation failed!.\r\n");
    }

}

/**************************************************************
 * Function Name   : hermes_rand()
 * Description     : Thread safe version of rand()
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
int hermes_rand(void)
{
	int result;
	portENTER_CRITICAL();
	result = rand();
	portEXIT_CRITICAL();
	return result;
}

/**************************************************************
 * Function Name   : hermes_srand()
 * Description     : Thread safe version of srand()
 * Inputs          :
 * Outputs         :
 * Returns         :
 **************************************************************/
void hermes_srand(int seed)
{
	portENTER_CRITICAL();
	srand(seed);
	portEXIT_CRITICAL();
}

void mem_dump(uint8_t *addr, uint32_t len)
{
#define LINELEN 16
	uint32_t j;
	uint8_t c;
	uint8_t *end_addr = addr+len;
	zprintf(LOW_IMPORTANCE,"\r\n");
	while(addr<end_addr)
	{
		zprintf(LOW_IMPORTANCE,"%08x: ",(uint32_t)addr);
		zprintf(LOW_IMPORTANCE,"%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X ", \
			*addr,*(addr+1),*(addr+2),*(addr+3),*(addr+4),*(addr+5),*(addr+6),*(addr+7),	
			*(addr+8),*(addr+9),*(addr+10),*(addr+11),*(addr+12),*(addr+13),*(addr+14),*(addr+15));

		for (j=0; j<LINELEN; j++)
		{
			c = *(addr+j);
			if ((c>31) && (c<127))
				zprintf(LOW_IMPORTANCE,"%c",c);
			else
				zprintf(LOW_IMPORTANCE,".");		
		}
		zprintf(LOW_IMPORTANCE,"\r\n");
		DbgConsole_Flush();
		addr+=LINELEN;
	}
}
